## Create sample data

In [6]:
import pandas as pd
import numpy as np

In [7]:
data= pd.DataFrame([[2,3,4],[2,3,5],[5,4,3],[np.nan,np.nan,np.nan]])

In [8]:
data

     0    1    2
0  2.0  3.0  4.0
1  2.0  3.0  5.0
2  5.0  4.0  3.0
3  NaN  NaN  NaN

In [15]:
print(data.isnull())

       0      1      2
0  False  False  False
1  False  False  False
2  False  False  False
3   True   True   True

In [16]:
print(data[2].isnull())

0    False
1    False
2    False
3     True
Name: 2, dtype: bool

In [18]:
data[1].isnull().sum()

1

In [19]:
data[1].dropna

<bound method Series.dropna of 0    3.0
1    3.0
2    4.0
3    NaN
Name: 1, dtype: float64>

In [22]:
data.dropna

<bound method DataFrame.dropna of      0    1    2
0  2.0  3.0  4.0
1  2.0  3.0  5.0
2  5.0  4.0  3.0
3  NaN  NaN  NaN>

In [23]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [24]:
data

     0    1    2
0  2.0  3.0  4.0
1  2.0  3.0  5.0
2  5.0  4.0  3.0
3  NaN  NaN  NaN

## filling Na values with zero

In [26]:
data.fillna(0)

     0    1    2
0  2.0  3.0  4.0
1  2.0  3.0  5.0
2  5.0  4.0  3.0
3  0.0  0.0  0.0

In [29]:
data.fillna(method='ffill')

     0    1    2
0  2.0  3.0  4.0
1  2.0  3.0  5.0
2  5.0  4.0  3.0
3  5.0  4.0  3.0

In [30]:
data.fillna(method='bfill')

     0    1    2
0  2.0  3.0  4.0
1  2.0  3.0  5.0
2  5.0  4.0  3.0
3  NaN  NaN  NaN

In [31]:
data.fillna(method='ffill',axis=1)

     0    1    2
0  2.0  3.0  4.0
1  2.0  3.0  5.0
2  5.0  4.0  3.0
3  NaN  NaN  NaN